README.org
#+TITLE: Proposal for "The GSoC Heat"
#+OPTIONS: toc:nil

* Student Info
+ *Name:* Abhishek Prasad
+ *Github Username:* [[https://github.com/Compro-Prasad][Compro-Prasad]]
+ *Email:* comproprasad@gmail.com
+ *Telephone:* +91 7602867497

* Code Sample

https://github.com/NIT-dgp/manga/pull/48\\
https://github.com/NIT-dgp/manga/pull/51

* Project Info

** Project Title:
Adding GUI to the manga downloader

** Project Abstract:
A GUI support written using Gtk will be added to the manga downloader
for point and click support instead of running commands by hand from
the terminal.

** Proposal Detailed Description/Timeline:
+ *Jan 27 - Jan 28:* Dedicated to removing issue [[https://github.com/NIT-dgp/manga/issues/5][#5]] and studying Gtk
+ *Jan 28 - Jan 29:* Will be designing the UI
+ *Jan 29 - Jan 30:* Setting up signal handlers to UI elements
+ *Jan 30 - Jan 31:* Writing callback functions and stabilizing the code
+ *Jan 31 - Feb 01:* Writing a parser for =newsteller= if possible([[https://github.com/NIT-dgp/manga/issues/26][#26]])

* Experience
+ C/C++
+ Bash
+ Python
+ PHP
+ Emacs Lisp
+ Qt

* Extra Information

** University info
+ *Name:* NIT Durgapur
+ *Major:* Information Technology
+ *Current Year:* Second
+ *Expected Graduation Year:* 2019
+ *Degree:* B. Tech

** Other Contact Info
*Gitter:* @Compro-Prasad

* Future involvement
I would be fixing issues and stabilizing the manga downloader in the future
till it gets stable.
