README.tex
% Created 2017-01-26 Thu 22:53
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Compro Prasad}
\date{\today}
\title{Proposal for "The GSoC Heat"}
\hypersetup{
 pdfauthor={Compro Prasad},
 pdftitle={Proposal for "The GSoC Heat"},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Student Info}
\label{sec:orgb3fef3f}
\begin{itemize}
\item \textbf{Name:} Abhishek Prasad
\item \textbf{Github Username:} \href{https://github.com/Compro-Prasad}{Compro-Prasad}
\item \textbf{Email:} comproprasad@gmail.com
\item \textbf{Telephone:} +91 7602867497
\end{itemize}

\section{Code Sample}
\label{sec:orgcc1ef0d}

\url{https://github.com/NIT-dgp/manga/pull/48}\\
\url{https://github.com/NIT-dgp/manga/pull/51}

\section{Project Info}
\label{sec:org5d548a8}

\subsection{Project Title:}
\label{sec:org3b8f3d6}
Adding GUI to the manga downloader

\subsection{Project Abstract:}
\label{sec:org4a0b607}
A GUI support written using Gtk will be added to the manga downloader
for point and click support instead of running commands by hand from
the terminal.

\subsection{Proposal Detailed Description/Timeline:}
\label{sec:org64bf0e2}
\begin{itemize}
\item \textbf{Jan 27 - Jan 28:} Dedicated to removing issue \href{https://github.com/NIT-dgp/manga/issues/5}{\#5} and studying Gtk
\item \textbf{Jan 28 - Jan 29:} Will be designing the UI
\item \textbf{Jan 29 - Jan 30:} Setting up signal handlers to UI elements
\item \textbf{Jan 30 - Jan 31:} Writing callback functions and stabilizing the code
\item \textbf{Jan 31 - Feb 01:} Writing a parser for \texttt{newsteller} if possible(\href{https://github.com/NIT-dgp/manga/issues/26}{\#26})
\end{itemize}

\section{Experience}
\label{sec:orgeb1fbc5}
\begin{itemize}
\item C/C++
\item Bash
\item Python
\item PHP
\item Emacs Lisp
\item Qt
\end{itemize}

\section{Extra Information}
\label{sec:org800fe6f}

\subsection{University info}
\label{sec:org315877f}
\begin{itemize}
\item \textbf{Name:} NIT Durgapur
\item \textbf{Major:} Information Technology
\item \textbf{Current Year:} Second
\item \textbf{Expected Graduation Year:} 2019
\item \textbf{Degree:} B. Tech
\end{itemize}

\subsection{Other Contact Info}
\label{sec:org8661524}
\textbf{Gitter:} @Compro-Prasad

\section{Future involvement}
\label{sec:org32b3ebc}
I would be fixing issues and stabilizing the manga downloader in the future
till it gets stable.
\end{document}